TAL_INT_GIT/Sample Data/Nupco/ASN_G3/Input/latest/asng3_newinputxml/asng3_newinputxml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header />
   <soapenv:Body>
      <urn:Z_GRN_HOS_OUTBOUND xmlns:urn="urn:sap-com:document:sap:rfc:functions">
         <GRN_HOS_OUTBOUND>
           <item>
               <NUPCO_PO_NO>8400000284</NUPCO_PO_NO>
               <NUPCO_PO_ITEM>100</NUPCO_PO_ITEM>
               <NUPCO_MATERIAL>5121160300000</NUPCO_MATERIAL>
               <DOC_DATE>2021-01-27</DOC_DATE>
               <POST_DATE>2021-01-27</POST_DATE>
               <MOVT_TYPE>101</MOVT_TYPE>
               <DEL_NOTE>0510</DEL_NOTE>
               <BILL_OF_LADDING>000-000-209</BILL_OF_LADDING>
               <QUATITY>177</QUATITY>
               <PLANT>C2C1</PLANT>
              <STORAGE_LOC>1000</STORAGE_LOC>
             <MOH_COD>1</MOH_COD>
               <VENDOR_BATCH>BN201507A</VENDOR_BATCH>
               <MANUF_DAT>2020-03-01</MANUF_DAT>
               <SLED_BBD>2023-02-28</SLED_BBD>
               <VENDOR_NO>400053</VENDOR_NO>
               <_--33PL_REF>345667</_--33PL_REF>
            </item>
            <item>
               <NUPCO_PO_NO>8400000284</NUPCO_PO_NO>
               <NUPCO_PO_ITEM>100</NUPCO_PO_ITEM>
               <NUPCO_MATERIAL>5121160300000</NUPCO_MATERIAL>
               <DOC_DATE>2021-01-27</DOC_DATE>
               <POST_DATE>2021-01-27</POST_DATE>
               <MOVT_TYPE>101</MOVT_TYPE>
               <DEL_NOTE>0510</DEL_NOTE>
               <BILL_OF_LADDING>000-000-209</BILL_OF_LADDING>
               <QUATITY>103</QUATITY>
               <PLANT>C2C1</PLANT>
               <STORAGE_LOC>1000</STORAGE_LOC>
               <MOH_COD>1</MOH_COD>
               <VENDOR_BATCH>BN201506A</VENDOR_BATCH>
               <MANUF_DAT>2020-03-01</MANUF_DAT>
               <SLED_BBD>2023-02-28</SLED_BBD>
               <VENDOR_NO>400053</VENDOR_NO>
               <_--33PL_REF>345667</_--33PL_REF>
            </item>
         </GRN_HOS_OUTBOUND>
          <RETURN>
            <item>
               <TYPE></TYPE>
               <ID></ID>
               <NUMBER></NUMBER>
               <MESSAGE></MESSAGE>
               <LOG_NO></LOG_NO>
               <LOG_MSG_NO></LOG_MSG_NO>
               <MESSAGE_V1></MESSAGE_V1>
               <MESSAGE_V2></MESSAGE_V2>
               <MESSAGE_V3></MESSAGE_V3>
               <MESSAGE_V4></MESSAGE_V4>
               <PARAMETER></PARAMETER>
               <ROW></ROW>
               <FIELD></FIELD>
               <SYSTEM></SYSTEM>
            </item>
         </RETURN>
      </urn:Z_GRN_HOS_OUTBOUND>
   </soapenv:Body>
</soapenv:Envelope>